---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.Hub
source: html/f2fd3f65-1f03-3f85-e7a7-154d57426382.htm
---
# Hub Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.